src/test.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://webservice.bccsgw.viettel.com/"><soap:Body><tns:gwOperation><input><username>a19bfa2be1695b1d6be5284fbd49f940</username><password>8af183e295b15cd9118219dbb26911bd</password><wscode>checkVtracking</wscode><param><name>username</name><value>vtracking</value></param><param><name>password</name><value>Vtracking2244@Qwer</value></param><param><name>msisdn</name><value>8562095499324</value></param><param><name>typeCheck</name><value>1</value></param><rawData></rawData></input></tns:gwOperation></soap:Body></soap:Envelope>